<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Windows Error Reporting</displayName>
  <description>Windows Error Reporting</description>
  <resources>
    <stringTable>
      <string id="CAT_WindowsErrorReporting">Windows Error Reporting</string>
      <string id="CAT_WindowsErrorReportingAdvanced">Advanced Error Reporting Settings</string>
      <string id="CAT_WindowsErrorReportingConsent">Consent</string>
      <string id="PCH_AllOrNoneDef">Default application reporting settings</string>
      <string id="PCH_AllOrNoneDef_Exclude">Do not report any application errors</string>
      <string id="PCH_AllOrNoneDef_Help">This setting controls whether or not errors in general applications are included when error reporting is enabled.

When this setting is enabled, The 'Default' dropdown list allows you to choose whether or not to report all application errors or no application errors by default.

When the 'Report all errors in Microsoft applications' checkbox is checked, all errors in Microsoft applications will be reported, regardless of the setting in the 'Default' dropdown list.

When the 'Report all errors in Windows components' checkbox is checked, all errors in Windows applications will be reported, regardless of the setting in the 'Default' dropdown list.

If this setting is disabled, or not configured, the user will be able to adjust this setting via the control panel, which is set to 'upload all applications' by default.

This setting is ignored if the 'Configure Error Reporting' setting is disabled or not configured.

Also see the 'Configure Error Reporting' and 'Report Operating System Errors' policies.</string>
      <string id="PCH_AllOrNoneDef_Include">Report all application errors</string>
      <string id="PCH_AllOrNoneEx">List of applications to never report errors for</string>
      <string id="PCH_AllOrNoneEx_Help">This setting controls error reporting for errors in general applications when error reporting is enabled.

The "Default" dropdown list allows you to choose whether or not to report all application errors or no application errors by default.

To create a list of applications that error reporting will report for, click the "Show" button next to "Report errors for applications on this list" and edit the list of application filenames (example: notepad.exe).  Errors generated by applications in this list will be reported, even if "Default" is set to report no application errors.  You may use the "Report all errors in Microsoft applications" and "Report all errors in Windows components" checkboxes to implicitly add applications in these categories to the include list.  Note that the "Microsoft applications" category includes the "Windows components" category.

To create a list of applications that error reporting will exclude from reporting, click the "Show" button next to "Exclude errors for applications on this list".  Errors generated by applications in this list will never be reported, even if the default is set to report all application errors.

The exclude list has priority, so if an application is listed in the include list and exclude list the application will be excluded.  You may also use the exclude list to exclude specific Microsoft applications or Windows components if you implicitly included these categories in the include list via the two checkboxes.

If you disable this setting or do not configure it, the user will be able to adjust this setting via the control panel, which is set to 'upload all applications' by default.</string>
      <string id="PCH_AllOrNoneInc">List of applications to always report errors for</string>
      <string id="PCH_AllOrNoneInc_Help">This setting specifies the applications that are always included in error reporting.

When this setting is enabled, You can create a list of applications that are always included in error reporting: click the 'Show' button, and edit the list of application file names. The file names must include the .exe file name extension (for example, 'notepad.exe'). Errors generated by applications on this list will be reported, even if the Default dropdown in the Default Application Reporting setting is set to report no application errors.

If the 'Report all errors in Microsoft applications' or 'Report all errors in Windows components' checkbox in the Default Application Reporting setting is checked, error reporting will report errors as though all applications in these categories were added to this list. (Note: The 'Microsoft applications' category includes the 'Windows components' category.

When this setting is disabled or not configured, no list of explicitly included files will be used, though the two checkboxes mentioned above will still be honored.

Also see the "Default Application Reporting" and "Application Exclusion List" policies.

This setting will be ignored if the 'Configure Error Reporting' setting is disabled or not configured.</string>
      <string id="PCH_ConfigureReport">Configure Error Reporting</string>
      <string id="PCH_ConfigureReport_Help">Configures how errors are reported and what information is sent when Error Reporting is enabled.

This Policy will not enable or disable Error Reporting, to do so use the "Turn off Windows Error Reporting" policy in Computer Configuration/Administrative Templates/System/Internet Communication Management/Internet Communication settings.

If this setting is enabled, it will override any settings made via the control panel for error reporting, and default values will be used for any error reporting policies that are not configured (even if settings were adjusted via the control panel).

If this setting is not configured, the user will be able to adjust the setting via the control panel, which is set to 'enable reporting' by default on Windows XP and to ‘report to Queue’ on Windows Server 2003.

If this setting is disabled, configuration settings will be set to the default (unchecked for check boxes and empty for text boxes).

- "Do not display links to any Microsoft ‘More information’ Web sites":  Select this if you do not want error dialogs to display links to Microsoft Web sites.

- "Do not collect additional files": Select this if you do not want additional files to be collected and included in the error reports.

- "Do not collect additional machine data": Select this if you do not want additional information about the computer to be collected and included in the error reports.

- "Force queue mode for application errors": Select this if you do not want users to report errors. When this is selected, the errors are placed in a queue directory, and the next administrator to log onto the machine will be able to report the error.

- "Corporate file path": Type a UNC path to enable Corporate Error Reporting.  All errors will be stored at the specified location instead of being sent directly to Microsoft, and the next administrator to log onto the machine will be able to report the error.

- "Replace instances of the word ‘Microsoft’ with":  Use this to customize error report dialogs.  The word "Microsoft" will be replaced with the specified text.

Also, see the "Display Error Notification settings" in this same folder and "Turn off Windows Error Reporting" in Computer Configuration/Administrative Templates/System/Internet Communication Management/Internet Communication settings.

Important: If "Turn off Windows Error Reporting" is not configured, then Control Panel settings will override these settings.</string>
      <string id="PCH_ReportOperatingSystemFaults">Report operating system errors</string>
      <string id="PCH_ReportOperatingSystemFaults_Help">This setting controls whether or not errors in the operating system are included when error reporting is enabled.

When this setting is enabled, error reporting will include operating system errors.

When this setting is disabled, operating system errors will not be included in error reporting.

If you do not configure this setting, the user will be able to adjust this setting via the control panel, which is set to 'upload operating system errors' by default

Also see the 'Configure Error Reporting' setting.</string>
      <string id="PCH_ShowUI">Display Error Notification</string>
      <string id="PCH_ShowUI_Help">Use this setting to control whether or not a user is given the choice to report an error.

When Display Error Notification is enabled, the user will be notified that an error has occurred and will be given access to details about the error.  If the Configure Error Reporting setting is also enabled, the user will also be given the choice of whether to report the error.

When Display Error Notification is not enabled, the user will not be given the choice of whether to report the error. If the Configure Error Reporting setting is enabled, the error will be automatically reported, but the user will not be notified that an error has occurred.

Disabling this setting is useful for server machines that do not have interactive users.

If you do not configure this setting, the user will be able to adjust the setting via the control panel, which is set to 'enable notification' by default on Windows XP Personal and Windows XP Professional machines and 'disable notification' on servers.

Also, see the "Configure Error Reporting" policy.</string>
      <string id="WerArchive">Configure Report Archive</string>
      <string id="WerArchiveEverything">Store all</string>
      <string id="WerArchiveExp">This setting controls the behavior of the Windows Error Reporting archive.  If Archive behavior is set to "Store all", all data collected for each report will be stored in the appropriate location.  If Archive behavior is set to "Store parameters only", only the minimum information required to check for an existing solution will be stored.  The setting for "Maximum number of reports to store" determines how many reports can be stored before old reports are automatically deleted.  If this setting is disabled, no Windows Error Reporting information will be stored.</string>
      <string id="WerArchiveOnlyMetaData">Store parameters only</string>
      <string id="WerCER">Configure Corporate Windows Error Reporting</string>
      <string id="WerCERExp">This setting determines the corporate server to which Windows Error Reporting will send reports (instead of sending reports to Microsoft). Server port indicates the port to use on the target server. Connect using SSL determines whether Windows will send reports to the server using a secured connection.</string>
      <string id="WerConsentAlwaysAsk">Always ask before sending data</string>
      <string id="WerConsentCustomize">Customize consent settings</string>
      <string id="WerConsentCustomizeExp">This policy setting determines the consent behavior of Windows Error Reporting for specific event types.

If this policy setting is enabled and the consent level is set to "0" (Disable), Windows Error Reporting will not send any data to Microsoft for this event.  If the consent level is set to "1" (Always ask before sending data), Windows will prompt the user for consent to send reports. If the consent level is set to "2" (Send parameters), the minimum data required to check for an existing solution will be sent automatically, and Windows will prompt the user for consent to send any additional data requested by Microsoft. If the consent level is set to "3" (Send parameters and safe additional data), the minimum data required to check for an existing solution as well as data which Windows has determined does not contain (within a high probability) personally identifiable data will be sent automatically, and Windows will prompt the user for consent to send any additional data requested by Microsoft. If the consent level is set to "4" (Send all data), any data requested by Microsoft will be sent automatically.

If this setting is disabled or not configured then consent will default to the default consent setting.</string>
      <string id="WerConsentDisabled">Disable</string>
      <string id="WerConsentEverything">Send all data</string>
      <string id="WerConsentOverride">Ignore custom consent settings</string>
      <string id="WerConsentOverrideExp">This setting determines the behavior of the default consent setting in relation to custom consent settings. If this setting is enabled, the default Consent level setting will always override any other consent setting.  If this setting is disabled or not configured, each custom consent setting will determine the consent level for that event type and the default consent setting will determine the consent level of any other reports.</string>
      <string id="WerConsentParamsAndSafeData">Send parameters and safe additional data</string>
      <string id="WerConsentParamsOnly">Send parameters</string>
      <string id="WerDefaultConsent">Configure Default consent</string>
      <string id="WerDefaultConsentExp">This setting determines the consent behavior of Windows Error Reporting.  If Consent level is set to "Always ask before sending data",  Windows will prompt the user for consent to send reports.  If Consent level is set to "Send parameters", the minimum data required to check for an existing solution will be sent automatically, and Windows will prompt the user for consent to send any additional data requested by Microsoft.  If Consent level is set to "Send parameters and safe additional data", the minimum data required to check for an existing solution as well as data which Windows has determined does not contain (within a high probability) personally identifiable data will be sent automatically, and Windows will prompt the user for consent to send any additional data requested by Microsoft.  If Consent level is set to "Send all data",  any data requested by Microsoft will be sent automatically.  If this setting is disabled or not configured then consent will default to "Always ask before sending data".</string>
      <string id="WerDisable">Disable Windows Error Reporting</string>
      <string id="WerDisabledExp">If this setting is enabled, Windows Error Reporting will not send any problem information to Microsoft.  Additionally, solution information will not be available in the Action Center control panel.</string>
      <string id="WerDoNotShowUI">Prevent display of the user interface for critical errors</string>
      <string id="WerDoNotShowUIExp">This policy setting prevents the display of the user interface for critical errors.

If you enable this policy setting, Windows Error Reporting prevents the display of the user interface for critical errors.

If you disable or do not configure this policy setting, Windows Error Reporting displays the user interface for critical errors. 
</string>
      <string id="WerExlusion">List of applications to be excluded</string>
      <string id="WerExlusionExp">This setting determines the behavior of the error reporting exclusion list.  Windows will not send reports for any process added to this list.  Click "Show" to display the exclusion list.  In the Show Contents dialog box in the Value column, type a process name to add a process to the list.  To remove a process from the list, click the process name to be removed and press the DELETE key. Click "OK" to save the list.</string>
      <string id="WerForceAdminQueue">Always queue for administrator</string>
      <string id="WerForceQueue">Always queue</string>
      <string id="WerNoLogging">Disable Logging</string>
      <string id="WerNoLoggingExp">If this setting is enabled Windows Error Reporting events will not be logged to the system event log.</string>
      <string id="WerNoSecondLevelData">Do not send additional data</string>
      <string id="WerNoSecondLevelDataExp">If this setting is enabled any additional data requests from Microsoft in response to a Windows Error Reporting event will be automatically declined without notice to the user.</string>
      <string id="WerQueue">Configure Report Queue</string>
      <string id="WerMachineQueueExp">This setting determines the behavior of the Windows Error Reporting queue.  If Queuing behavior is set to "Default",  Windows will decide each time a problem occurs whether the report should be queued or the user should be prompted to send it immediately.  If Queuing behavior is set to "Always queue", all  reports will be queued until the user is notified to send them or until the user chooses to send them using the Solutions to Problems control panel.  If Queuing behavior is set to "Always queue for administrator", reports will be queued until an administrator is notified to send them or chooses to send them using the Solutions to Problems control panel.  The setting for "Maximum number of reports to queue" determines how many reports can be queued before old reports are automatically deleted.  The setting for "Number of days between solution check reminders" determines the interval time between the display of system notifications which remind the user to check for solutions to problems.  A setting of 0 will disable the reminder.  If the Windows Error Reporting queue setting is disabled, no Windows Error Reporting information will be queued and users will be able to send reports only at the time a problem occurs.</string>
      <string id="WerUserQueueExp">This setting determines the behavior of the Windows Error Reporting queue.  If Queuing behavior is set to "Default",  Windows will decide each time a problem occurs whether the report should be queued or the user should be prompted to send it immediately.  If Queuing behavior is set to "Always queue", all  reports will be queued until the user is notified to send them or until the user chooses to send them using the Solutions to Problems control panel.  The setting for "Maximum number of reports to queue" determines how many reports can be queued before old reports are automatically deleted.  The setting for "Number of days between solution check reminders" determines the interval time between the display of system notifications which remind the user to check for solutions to problems.  A setting of 0 will disable the reminder.  If the Windows Error Reporting queue setting is disabled, no Windows Error Reporting information will be queued and users will be able to send reports only at the time a problem occurs.</string>
      <string id="WerQueueNormal">Default</string>
    </stringTable>
    <presentationTable>
      <presentation id="PCH_AllOrNoneDef">
        <dropdownList refId="PCH_AllOrNoneDef_List" noSort="true" defaultItem="0">Default:</dropdownList>
        <checkBox refId="PCH_AllOrNoneIncMS_Chk" defaultChecked="true">Report all errors in Microsoft applications.</checkBox>
        <checkBox refId="PCH_AllOrNoneWinComp_Chk" defaultChecked="true">Report all errors in Windows components.</checkBox>
      </presentation>
      <presentation id="PCH_AllOrNoneEx">
        <listBox refId="PCH_AllOrNoneEx_List">Exclude errors for applications on this list:</listBox>
      </presentation>
      <presentation id="PCH_AllOrNoneInc">
        <listBox refId="PCH_AllOrNoneInc_List">Report errors for applications on this list:</listBox>
      </presentation>
      <presentation id="PCH_ConfigureReport">
        <checkBox refId="PCH_NoExternalURL_Chk">Do not display links to any Microsoft provided 'more information' web sites.</checkBox>
        <checkBox refId="PCH_NoFileCollect_Chk">Do not collect additional files</checkBox>
        <checkBox refId="PCH_NoLevelTwo_Chk">Do not collect additional machine data</checkBox>
        <checkBox refId="PCH_ForceQ_Chk">Force queue mode for application errors</checkBox>
        <textBox refId="PCH_DumpPath_Edit">
          <label>Corporate upload file path:</label>
        </textBox>
        <textBox refId="PCH_CompanyText_Edit">
          <label>Replace instances of the word 'Microsoft' with:</label>
        </textBox>
      </presentation>
      <presentation id="WerArchive_1">
        <dropdownList refId="WerArchiveBehavior" noSort="true">Archive behavior:</dropdownList>
        <decimalTextBox refId="WerMaxArchiveCount" defaultValue="500" spinStep="50">Maximum number of reports to store:</decimalTextBox>
      </presentation>
      <presentation id="WerArchive_2">
        <dropdownList refId="WerArchiveBehavior" noSort="true">Archive behavior:</dropdownList>
        <decimalTextBox refId="WerMaxArchiveCount" defaultValue="500" spinStep="50">Maximum number of reports to store:</decimalTextBox>
      </presentation>
      <presentation id="WerCER">
        <textBox refId="WerCERServer">
          <label>Corporate server name:</label>
        </textBox>
        <checkBox refId="WerCERUseSSL">Connect using SSL</checkBox>
        <decimalTextBox refId="WerCERCorporatePortNumber" defaultValue="1273" spin="false">Server port:</decimalTextBox>
      </presentation>
      <presentation id="WerConsentCustomize_1">
        <listBox refId="WerConsentCustomize">Customize consent settings</listBox>
      </presentation>
      <presentation id="WerConsentCustomize_2">
        <listBox refId="WerConsentCustomize">Customize consent settings</listBox>
      </presentation>
      <presentation id="WerDefaultConsent_1">
        <dropdownList refId="WerConsent" noSort="true">Consent level</dropdownList>
      </presentation>
      <presentation id="WerDefaultConsent_2">
        <dropdownList refId="WerConsent" noSort="true">Consent level</dropdownList>
      </presentation>
      <presentation id="WerExlusion_1">
        <listBox refId="WerExlusionList">List of applications to be excluded</listBox>
      </presentation>
      <presentation id="WerExlusion_2">
        <listBox refId="WerExlusionList">List of applications to be excluded</listBox>
      </presentation>
      <presentation id="WerQueue_1">
        <dropdownList refId="WerQueueBehavior" noSort="true">Queuing behavior:</dropdownList>
        <decimalTextBox refId="WerMaxQueueCount" defaultValue="50" spinStep="10">Maximum number of reports to queue:</decimalTextBox>
        <decimalTextBox refId="WerUpdateCheck" defaultValue="14">Number of days between solution check reminders:</decimalTextBox>
      </presentation>
      <presentation id="WerQueue_2">
        <dropdownList refId="WerQueueBehavior" noSort="true">Queuing behavior:</dropdownList>
        <decimalTextBox refId="WerMaxQueueCount" defaultValue="50" spinStep="10">Maximum number of reports to queue:</decimalTextBox>
        <decimalTextBox refId="WerUpdateCheck" defaultValue="14">Number of days between solution check reminders:</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
